Repository: Zakaria-Abdikadir/fuelstationapp
Catalog: lib/l10n/app_*.arb
Languages: sw

# appTitle
source: Fuel Station App
sw: Programu ya Kituo cha Mafuta

# appName
source: Fuel Station
sw: Kituo cha Mafuta

# appTagline
source: Your Digital Fuel Solution
sw: Suluhisho lako la Kidijitali la Mafuta

# navHome
source: Home
sw: Mwanzo

# navFuel
source: Fuel
sw: Mafuta

# navPayment
source: Payment
sw: Malipo

# navDashboard
source: Dashboard
sw: Dashibodi

# navManageStations
source: Manage Stations
sw: Dhibiti Vituo

# navManagePrices
source: Manage Prices
sw: Sasisha Bei

# navReports
source: Reports
sw: Ripoti

# navSettings
source: Settings
sw: Mipangilio

# commonCancel
source: Cancel
sw: Ghairi

# commonClose
source: Close
sw: Funga

# commonSave
source: Save
sw: Hifadhi

# commonDone
source: Done
sw: Imekamilika

# commonRefresh
source: Refresh
sw: Onyesha upya

# commonSelect
source: Select
sw: Chagua

# commonLogout
source: Logout
sw: Toka

# commonClear
source: Clear
sw: Futa

# commonPrint
source: Print
sw: Chapisha

# commonViewReceipt
source: View Receipt
sw: Tazama Risiti

# commonName
source: Name
sw: Jina

# commonEmail
source: Email
sw: Barua pepe

# commonContinue
source: Continue
sw: Endelea

# settingsTitle
source: Settings
sw: Mipangilio

# settingsSectionGeneral
source: General
sw: Jumla

# settingsSectionAbout
source: About
sw: Kuhusu

# settingsNotificationsTitle
source: Notifications
sw: Arifa

# settingsNotificationsSubtitle
source: Enable or disable notifications
sw: Washa au zima arifa

# settingsLanguageTitle
source: Language
sw: Lugha

# settingsThemeTitle
source: Theme
sw: Mandhari

# settingsBackupTitle
source: Backup Data
sw: Hifadhi Nakala ya Data

# settingsBackupSubtitle
source: Backup your data to cloud
sw: Hifadhi data yako kwenye wingu

# settingsRestoreTitle
source: Restore Data
sw: Rejesha Data

# settingsRestoreSubtitle
source: Restore data from backup
sw: Rejesha data kutoka kwenye nakala

# settingsClearCacheTitle
source: Clear Cache
sw: Futa Kache

# settingsClearCacheSubtitle
source: Clear app cache and temporary files
sw: Futa kache na faili za muda za programu

# settingsAppVersionTitle
source: App Version
sw: Toleo la Programu

# settingsTermsTitle
source: Terms & Conditions
sw: Sheria na Masharti

# settingsTermsSubtitle
source: Read our terms and conditions
sw: Soma sheria na masharti yetu

# settingsPrivacyTitle
source: Privacy Policy
sw: Sera ya Faragha

# settingsPrivacySubtitle
source: Read our privacy policy
sw: Soma sera yetu ya faragha

# settingsLanguageDialogTitle
source: Select Language
sw: Chagua Lugha

# settingsThemeDialogTitle
source: Select Theme
sw: Chagua Mandhari

# settingsProfileEditTitle
source: Edit Profile
sw: Hariri Wasifu

# settingsProfileFillAllFields
source: Please fill all fields
sw: Tafadhali jaza maeneo yote

# settingsProfileUpdated
source: Profile updated successfully
sw: Wasifu umeboreshwa kwa mafanikio

# settingsProfilePhotoUpdated
source: Profile photo updated
sw: Picha ya wasifu imesasishwa

# settingsProfilePhotoError
source: Couldn't update profile photo
sw: Imeshindikana kusasisha picha ya wasifu

# settingsChangePhoto
source: Change photo
sw: Badilisha picha

# settingsLanguageChanged
source: Language changed to {language}. Setting saved successfully.
sw: Lugha imebadilishwa kuwa {language}. Mpangilio umehifadhiwa.

# settingsThemeChanged
source: Theme changed to {theme}
sw: Mandhari imebadilishwa kuwa {theme}

# settingsLogoutDialogTitle
source: Logout
sw: Toka

# settingsLogoutDialogMessage
source: Are you sure you want to logout?
sw: Una uhakika unataka kutoka?

# settingsLogoutSuccess
source: Logged out successfully
sw: Umetoka kwa mafanikio

# settingsClearCacheDialogTitle
source: Clear Cache
sw: Futa Kache

# settingsClearCacheDialogMessage
source: Are you sure you want to clear all cache?
sw: Una uhakika unataka kufuta kache yote?

# settingsClearCacheSuccess
source: Cache cleared successfully
sw: Kache imefutwa kwa mafanikio

# settingsBackupSuccess
source: Backup saved to {path}
sw: Nakala imehifadhiwa kwenye {path}

# settingsBackupError
source: Backup failed: {error}
sw: Kuhifadhi nakala kimeshindwa: {error}

# settingsRestoreSuccess
source: Data restored successfully.
sw: Data imerejeshwa kwa mafanikio.

# settingsRestoreError
source: Restore failed: {error}
sw: Kurejesha kimeshindwa: {error}

# languageEnglish
source: English
sw: Kiingereza

# languageSwahili
source: Swahili
sw: Kiswahili

# languageFrench
source: French
sw: Kifaransa

# languageSpanish
source: Spanish
sw: Kihispania

# themeLight
source: Light
sw: Nuru

# themeDark
source: Dark
sw: Giza

# themeSystem
source: System
sw: Mfumo

# termsAndConditionsTitle
source: Terms & Conditions
sw: Sheria na Masharti

# termsAndConditionsBody
source: 1. Acceptance of Terms By using this Fuel Station App, you agree to be bound by these Terms and Conditions. 2. Use of Service The app is provided for fuel purchase and management purposes only. 3. User Responsibilities - Users must provide accurate information - Users are responsible for maintaining account security - Users must comply with all applicable laws 4. Limitation of Liability The app provider is not liable for any damages arising from the use of this service. 5. Modifications We reserve the right to modify these terms at any time. Last updated: {year}
sw: 1. Kukubalika kwa Sheria Kwa kutumia Programu hii ya Kituo cha Mafuta, unakubali kufungwa na Sheria na Masharti haya. 2. Matumizi ya Huduma Programu hii imetolewa kwa ajili ya ununuzi wa mafuta na usimamizi pekee. 3. Wajibu wa Mtumiaji - Watumiaji wanapaswa kutoa taarifa sahihi - Watumiaji wanawajibika kulinda usalama wa akaunti - Watumiaji lazima watii sheria zote zinazohusika 4. Kiasi cha Uwajibikaji Mtoa programu hayawajibiki kwa madhara yoyote yanayotokana na matumizi ya huduma hii. 5. Mabadiliko Tunahifadhi haki ya kubadilisha sheria hizi wakati wowote. Imesasishwa mwisho: {year}

# privacyPolicyTitle
source: Privacy Policy
sw: Sera ya Faragha

# privacyPolicyBody
source: Privacy Policy 1. Information We Collect - Personal information (name, email) - Location data for finding nearby stations - Purchase history and preferences 2. How We Use Your Information - To provide and improve our services - To process transactions - To send important notifications 3. Data Security We implement appropriate security measures to protect your personal information. 4. Data Sharing We do not sell your personal information. We may share data only for service provision. 5. Your Rights - Access your personal data - Request data deletion - Update your information 6. Contact Us For privacy concerns, contact us at privacy@fuelstation.com Last updated: {year}
sw: Sera ya Faragha 1. Taarifa Tunazokusanya - Taarifa binafsi (jina, barua pepe) - Data ya eneo kwa ajili ya kupata vituo vilivyo karibu - Historia ya ununuzi na mapendeleo 2. Jinsi Tunavyotumia Taarifa Zako - Kutoa na kuboresha huduma zetu - Kuchakata miamala - Kutuma arifa muhimu 3. Usalama wa Data Tunatumia hatua zinazofaa za usalama kulinda taarifa zako binafsi. 4. Kushiriki Data Hatuzui taarifa zako binafsi. Tunaweza kushiriki data kwa ajili ya utoaji huduma pekee. 5. Haki Zako - Kufikia data zako binafsi - Kuomba kufutwa kwa data - Kusasisha taarifa zako 6. Wasiliana Nasi Kwa masuala ya faragha, wasiliana nasi kupitia privacy@fuelstation.com Imesasishwa mwisho: {year}

# homeTitle
source: Find Fuel Stations
sw: Tafuta Vituo vya Mafuta

# homeSearchHint
source: Search stations or locations...
sw: Tafuta vituo au maeneo...

# homeNearbyStations
source: Nearby Stations
sw: Vituo Vilivyo Karibu

# homeStationsFound
source: {count, plural, =0 {No stations found} one {{count} station found} other {{count} stations found}}
sw: {count, plural, =0 {Hakuna vituo vilivyopatikana} one {Kituo {count} kimepatikana} other {Vituo {count} vimepatikana}}

# homeNoStationsFound
source: No stations found nearby
sw: Hakuna vituo vilivyo karibu

# homeRefresh
source: Refresh
sw: Onyesha upya

# homeErrorLocationServicesDisabled
source: Location services are disabled. Please enable them.
sw: Huduma za eneo zimezimwa. Tafadhali ziwashe.

# homeErrorLocationDenied
source: Location permissions are denied.
sw: Ruhusa za eneo zimekataliwa.

# homeErrorLocationDeniedForever
source: Location permissions are permanently denied.
sw: Ruhusa za eneo zimekataliwa kabisa.

# homeErrorGettingLocation
source: Error getting location: {error}
sw: Hitilafu katika kupata eneo: {error}

# homeErrorLoadingStations
source: Error loading stations: {error}
sw: Hitilafu katika kupakia vituo: {error}

# homeNoStationsFoundAction
source: Refresh
sw: Onyesha upya

# stationDistanceAway
source: {distance} km away
sw: {distance} km kutoka

# stationClosedLabel
source: Closed
sw: Imefungwa

# stationSelectButton
source: Select
sw: Chagua

# fuelTypePetrol
source: Petrol
sw: Petroli

# fuelTypeDiesel
source: Diesel
sw: Dizeli

# fuelSelectFuelType
source: Select Fuel Type
sw: Chagua Aina ya Mafuta

# fuelEnterQuantity
source: Enter Quantity
sw: Ingiza Kiasi

# fuelChoiceAmount
source: Amount (KES)
sw: Kiasi (KES)

# fuelChoiceLiters
source: Liters (L)
sw: Lita (L)

# fuelInputAmountLabel
source: Amount (KES)
sw: Kiasi (KES)

# fuelInputLitersLabel
source: Liters (L)
sw: Lita (L)

# fuelInputAmountHint
source: Enter amount
sw: Ingiza kiasi

# fuelInputLitersHint
source: Enter liters
sw: Ingiza lita

# fuelPricePerLiterLabel
source: Price per Liter:
sw: Bei kwa Lita:

# fuelLitersLabel
source: Liters:
sw: Lita:

# fuelAmountLabel
source: Amount:
sw: Kiasi:

# fuelTotalLabel
source: Total:
sw: Jumla:

# fuelInProgressTitle
source: Fueling in Progress...
sw: Kumimina Mafuta Kunaendelea...

# fuelStopButton
source: Stop Fueling
sw: Simamisha Kumimina

# fuelStartButton
source: Start Fueling
sw: Anza Kumimina

# fuelErrorEnterAmountOrLiters
source: Please enter amount or liters
sw: Tafadhali ingiza kiasi au lita

# fuelPumpStatus
source: Pump: {status}
sw: Pampu: {status}

# pumpStatusIdle
source: Idle
sw: Haifanyi kazi

# pumpStatusBusy
source: Busy
sw: Ina kazi

# pumpStatusInUse
source: In Use
sw: Inaendelea

# paymentTitle
source: Payment
sw: Malipo

# paymentSummaryTitle
source: Transaction Summary
sw: Muhtasari wa Muamala

# paymentSummaryStation
source: Station
sw: Kituo

# paymentSummaryFuelType
source: Fuel Type
sw: Aina ya Mafuta

# paymentSummaryQuantity
source: Quantity
sw: Kiasi

# paymentSummaryPricePerLiter
source: Price per Liter
sw: Bei kwa Lita

# paymentSummaryTotalLabel
source: Total Amount:
sw: Jumla ya Malipo:

# paymentMethodTitle
source: Select Payment Method
sw: Chagua Njia ya Malipo

# paymentMethodCard
source: Card
sw: Kadi

# paymentMethodCash
source: Cash
sw: Fedha taslimu

# paymentButtonPayNow
source: Pay Now
sw: Lipa Sasa

# paymentProcessing
source: Processing...
sw: Inachakata...

# paymentError
source: Payment failed: {error}
sw: Malipo yameshindwa: {error}

# paymentSuccessAppBarTitle
source: Payment Successful
sw: Malipo Yamefaulu

# paymentSuccessTitle
source: Payment Completed Successfully!
sw: Malipo Yamekamilika Kwa Mafanikio!

# paymentSuccessButtonViewReceipt
source: View Receipt
sw: Tazama Risiti

# paymentSuccessButtonDone
source: Done
sw: Imekamilika

# paymentReceiptTitle
source: Receipt
sw: Risiti

# paymentReceiptTransactionId
source: Transaction ID
sw: Kitambulisho cha Muamala

# paymentReceiptDate
source: Date
sw: Tarehe

# paymentReceiptFuelType
source: Fuel Type
sw: Aina ya Mafuta

# paymentReceiptQuantity
source: Quantity
sw: Kiasi

# paymentReceiptPricePerLiter
source: Price per Liter
sw: Bei kwa Lita

# paymentReceiptTotalAmount
source: Total Amount
sw: Jumla ya Malipo

# paymentReceiptPaymentMethod
source: Payment Method
sw: Njia ya Malipo

# paymentReceiptSuccessMessage
source: Payment Successful
sw: Malipo Yamefaulu

# paymentReceiptSuccessTagline
source: Payment Successful
sw: Malipo Yamefaulu

# paymentReceiptPrinted
source: Receipt printed successfully
sw: Risiti imechapishwa kwa mafanikio

# mainPlaceholderFuelTitle
source: Fuel
sw: Mafuta

# mainPlaceholderFuelMessage
source: Please select a station from Home
sw: Tafadhali chagua kituo kutoka Mwanzo

# mainPlaceholderPaymentTitle
source: Payment
sw: Malipo

# mainPlaceholderPaymentMessage
source: Complete a fueling session to proceed
sw: Kamilisha mchakato wa kumimina ili kuendelea

# dashboardTitle
source: Dashboard
sw: Dashibodi

# dashboardPeriodToday
source: Today
sw: Leo

# dashboardPeriodWeek
source: This Week
sw: Wiki Hii

# dashboardPeriodMonth
source: This Month
sw: Mwezi Huu

# dashboardStatTotalSales
source: Total Sales
sw: Jumla ya Mauzo

# dashboardStatFuelDispensed
source: Fuel Dispensed
sw: Mafuta Yaliyotolewa

# dashboardStatReceipts
source: Receipts
sw: Risiti

# dashboardStatTransactions
source: Transactions
sw: Miamala

# dashboardSalesPerformanceTitle
source: Sales Performance
sw: Utendaji wa Mauzo

# dashboardSalesPerformanceEmpty
source: No sales data available
sw: Hakuna data ya mauzo

# dashboardRecentTransactionsTitle
source: Recent Transactions
sw: Miamala ya Hivi Karibuni

# dashboardRecentTransactionsEmpty
source: No recent transactions
sw: Hakuna miamala ya hivi karibuni

# dashboardQuickActionsTitle
source: Quick Actions
sw: Vitendo vya Haraka

# dashboardQuickActionManageStations
source: Manage Stations
sw: Dhibiti Vituo

# dashboardQuickActionUpdatePrices
source: Update Prices
sw: Sasisha Bei

# receiptPaymentSuccessfulBanner
source: Payment Successful
sw: Malipo Yamefaulu
